LeTiti2772005/BiasPanelFirmware/boards.txt
yrc_biaspanel_vccgnd.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
yrc_biaspanel_vccgnd.menu.usbstack.nousb=No USB
yrc_biaspanel_vccgnd.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4only=IPv4 Only
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
yrc_biaspanel_vccgnd.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
yrc_biaspanel_vccgnd.menu.uploadmethod.default=Default (UF2)
yrc_biaspanel_vccgnd.menu.uploadmethod.default.build.ram_length=256k
yrc_biaspanel_vccgnd.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
yrc_biaspanel_vccgnd.menu.uploadmethod.default.upload.maximum_data_size=262144
yrc_biaspanel_vccgnd.menu.uploadmethod.default.upload.tool=uf2conv
yrc_biaspanel_vccgnd.menu.uploadmethod.default.upload.tool.default=uf2conv
yrc_biaspanel_vccgnd.menu.uploadmethod.default.upload.tool.network=uf2conv-network
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool=Picotool
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.build.ram_length=256k
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.upload.maximum_data_size=262144
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.upload.tool=picotool
yrc_biaspanel_vccgnd.menu.uploadmethod.picotool.upload.tool.default=picotool
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
yrc_biaspanel_vccgnd.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
